[
	{
		"firstName"	: "Richard",
		"lastName" 	: "Omar",
		"title"		: "Director of Education",
		"image"		: "../images/richard_omar.jpg",
		"bio"		: "Richard Omar received his training at Hofstra University and from Uta Hagen and Bobby Lewis in NYC. New York theater credits include Dracula in Dance with Me, Harker (New York International Fringe Festival), Rick in the world premiere of Theresa Rebeck’s The First Day, Wes in the NYC premiere of Beth Henley’s Lost (Theatre 4), Richard Loeb in Never the Sinner (The Directors Company), Bunny in The Secret History (The Directors Company), Hastings in Richard III with Austin Pendleton, Sherwood in Fruit Bat Safari Camp with Sally Mayes and Julie Halston. Richard was featured in The Unofficial New York Yale Cabaret’s tribute to Wendy Wasserstein (Wendy’s Words) at the Laurie Beechman Theater. As a ballroom dancer, he appeared on film with Leslie Caron, Patrick Stewart and Jennifer Beals. He has taught at the New Actors Workshop for Mike Nichols and George Morrison, at SUNY Purchase and at Hofstra University."
	},
	{
		"firstName"	: "Jay R.",
		"lastName" 	: "Goldenberg",
		"title"		: "Associate Director of Education",
		"image"		: "../images/jay_goldberg.jpg",
		"bio"		: "Jay Goldenberg received his MFA in acting from New York University School of the Arts and has worked as an actor, teacher and director. Jay has coached on the sets of features, miniseries, sitcoms and daytime drama. Some of the projects he has worked on are Say Anything with John Cusack and Ione Skye, the miniseries Elvis and Me, the TV series Moonlighting with Bruce Willis and Cybill Shepherd and the daytime drama General Hospital. Some of his private clients have included Salma Hayek, Cybill Shepherd, Alicia Silverstone, Estelle Getty, Michael Chiklis, Charles Kimbrough, Beth Howland, Ione Skye, Mary Wilson, Eric Close, Allyce Beasley, Trevor St. John, Nicollette Sheridan and several other actors working as principals in both film and television."
	},
	{
		"firstName"	: "Alan",
		"lastName" 	: "Rackham",
		"bio"		: "Received his MFA in Directing from NYU Film School, Tisch School of the Arts. Born on Prince Edward Island, Alan moved to New York City to pursue a career in the theater. After working professionally as an actor, Alan attended Columbia University, lived in Europe and then attended NYU, changing his focus to behind the camera as a director. While at NYU, Alan wrote and directed two short films, both of which have been shown at film festivals all over the world and have won him directing awards. Alan is currently in post-production on Chicken, a short film that serves as the thesis component of his master’s of fine arts degree from NYU."
	},
	{
		"firstName"	: "Amy",
		"lastName" 	: "Marcs",
		"bio"		: "Amy Marcs received a BA in Theater from Rider University, and is a long time student of Fred Kareman. As an actress, Amy has appeared at many regional theaters across the country. Most recently she was seen as Gorgeous Teitelbaum in The School House Theater’s production of The Sisters Rosensweig. Other credits include featured roles in Gemini, Kingdom of Earth, The Star Spangled Girl and And Miss Reardon Drinks a Little. She has performed in the independent film The Waiting Game. Her voice can be heard on numerous national network television and radio commercials. She recently played the role of Peg the Pig in the animated feature film Impy’s Island."
	},
	{
		"firstName"	: "Barry",
		"lastName" 	: "McNabb",
		"bio"		: "Barry McNabb earned a Bachelor of Science degree in Dance/Theater from the University of Oregon. His professional debut was for Bob Fosse as featured soloist and dance captain in Dancin’. Other highlights of his career include being an original Broadway cast member: The Phantom of the Opera and Me and My Girl; and director and/or choreographer: Broadway (Touch of a Poet, Easter Bonnet Competitions); Off Broadway (Irish Rep, CSC, Lincoln Center, the Public, Circle Rep, etc.); international (Madrid, Barcelona, Seoul, Monte Carlo, etc.); regional (Pittsburgh Public, Geva, Alley, Seattle 5th, etc.). His work on television includes Late Night with Conan O’Brien (13 years), Saturday Night Live (five years), The Howard Stern Show (five years). Award: Premio (Spain). Nominations: NY Drama Desk, Lucille Lortel, Connecticut Critics Circle, MAC, Bistro, Barrymore, Emmy, etc..."
	},
	{
		"firstName"	: "Becky",
		"lastName" 	: "London",
		"bio"		: "Becky London earned her MFA in Acting from Yale School of Drama and her BA, magna cum laude, in English language and literature from Yale University. Television credits include Blue Bloods, all three Law & OrdersThird Watch, Quantum Leap, Guiding Light and All MyChildren. Films include United 93, Changing Lanes, El Camino,Never Forever and A Very Serious Person. Becky has workedon Broadway in Marlene and at Lincoln Center in Ubu. Off-Broadway credits include Isn’t It Romantic, Othello, Last of the Red Hot Lovers and Jewtopia. Regional work includes the Old Globe, Yale Repertory Theatre, Trinity Rep, Cincinnati Playhouse, Provincetown Playhouse, Capital Rep, Portland Stage, Caldwell Playhouse and many others. Becky was a founding member of UNYYC, the Unofficial New York Yale Cabaret. In the company’s award-winning first season, she directed Separating the Men from the Bulls by Neal Lerner and Michael Heintzman, and in the second season she adapted and starred in Wendy’s Words, a tribute to the late Wendy Wasserstein."
	},
	{
		"firstName"	: "Ben",
		"lastName" 	: "Sander",
		"bio"		: "Ben Sander holds a BFA in Fashion Design from FIT and is the creator of Brini Maxwell, a domestic guru character featured in her own eponymous television show on the Style network. In addition to developing the character, he also executive produced the show, and produced an earlier version for local cable, which ran for five years. In 2004 Ben published Brini Maxwell’s Guide to Gracious Living and has since worked with NPR on a series of podcasts and made appearances on World News Now, The Conan O’Brien Show, the Oscar and Golden Globe pre-shows on E! and Style, Soap Talk and Tyra Banks among others. A devotee of mid-century culture and film, he writes articles about obscure films on his blog The Obscurity Factor and hosts screenings of select films at Chelsea Clearview Cinemas."
	},
	{
		"firstName"	: "Carol",
		"lastName" 	: "Kastendieck",
		"bio"		: "Carol Kastendieck holds an MFA from Carnegie Mellon University and has studied under Stella Adler, Robert Benedetti, John Houseman, Sonia Moore and Ted Pugh. Carol has directed over 100 plays, musicals and operas around the country. Most recently she directed Austin Pendleton in Richard III at the New Perspectives Theatre Company and When the World Was Green for the Michael Chekhov Theatre Company’s Sam Shepard Festival, both in NYC. Carol has taught at Juilliard, Hofstra University, Carnegie Mellon University,Miami University and the Riverside Shakespeare Company School. Carol is a member of the Society of Stage Directors and Choreographers and of the Actors Equity Association"
	},
	{
		"firstName"	: "David",
		"lastName" 	: "Title",
		"bio"		: "David Title holds an MFA in Directing from Rutgers University, Mason Gross School of Arts and a BA in theater from Hampshire College.  He has worked professionally in theater, film and television but for the past six years has specialized in digital and web video production.  David has developed and produced original shows for MySpace, Comedy Central, and many other online destination sites.  His videos have been viewed millions of times around the world.  David is currently a producer with Bravo Stage and Media as well as an independent corporate web video consultant."
	},
	{
		"firstName"	: "Donnie",
		"lastName" 	: "Mather",
		"bio"		: "Donnie Mather holds a BFA in Theatre with minor in Dance from Western Kentucky University. He is an instructor of Suzuki & Viewpoints Training.  He has taught at the Atlantic Acting School, NYU, Columbia University, Bard College, Fordham University, the New School, Hope College, Louisiana State University, University of Puerto Rico, and the Shakespeare Theatre of New Jersey.  Internationally, he has led workshops throughout South America in Bogota, Rio de Janeiro, São Paulo, Florianopolis, Uberlândia , and at the Iberoamericano Theatre Festival of Bogota.  He has over a dozen years experience in Suzuki and Viewpoints, training mostly with Anne Bogart and members of SITI Company as an Associate (2000-2007) as well as with Tina Landau and Mary Overlie.  Mather has performed in Macbeth, Nicholas & Alexandra, Seven Deadly Sins, Lilith (SITI Company); I, Claudius (Theatre Askew); Antony & Cleopatra, Comedy of Errors, Merchant of Venice, and Two Gentlemen of Verona (Shakespeare Theatre of New Jersey); and works by Charles Mee including Fetes de la Nuit (Dir. Kim Weild) and Trojan Women A Love Story (Dir. Tina Landau).  Mather created A Show of Force (FringeNYC, Hope College, Hudson Guild, Manizales Theatre Festival).  Mather is the founding artist of The Adaptations Project, performing in its inaugural production Kaddish (or The Key in the Window) based on the poetry of Allen Ginsberg."
	},
	{
		"firstName"	: "Eileen",
		"lastName" 	: "Connolly",
		"bio"		: "Eileen Connolly holds an MFA in Acting from the University of Minnesota, and a BA in Theatre and Dance from DeSales University. She is the founder and Artistic Director of Wallis Knot Theatre, where she creates, designs anddirects original multimedia productions, includingLate to the Republique (NYCDA), Dance with Me,Harker (New York International Fringe Festival) andSeeing Andre Gide (New Actors Workshop). As an actress she has worked Off Broadway and at the Meadow Brook and Birmingham theatres in Detroit, the Royal George in Chicago and the Walnut Street Theatre and Painted Bride Art Center in Philadelphia. As a director, she was honored to assist Betty Comden and Adolph Green on their revival of A Doll’s Life (York Theatre). She recently created the movement and combat for Irish Repertory Theatre’s production of Beowulf. For the University of Vermont, she was commissioned to co-author an adaptation of Aristophanes’ The Birds and Don Marquis’ Archy and Mehitabel."
	},
	{
		"firstName"	: "Ginger",
		"lastName" 	: "Eckert",
		"bio"		: "Ginger Eckert holds an MFA in Acting from Brown University/Trinity College. She is a New York based teacher of voice, speech, dialects and acting. Her teaching and training is rooted in experience with the work of Jones, Fitzmaurice, Skinner, Rodenburg, Berry, Alexander and Laban. Her dialect and voice coaching credits include Brotherhood (Showtime), Ripe Time, Trinity Repertory Company and many Shakespeare festivals, independent projects and private students. She is on the faculty at NYU/Tisch, at Playwrights Horizons Theater School and Atlantic Acting School. She has also taught at Brown University, Rhode Island College, Stone Soup Theatre Arts & ACTeen. She has performed with The Public Theater, The Kennedy Center, Trinity Repertory Company, Marin Theater Company, LaMama, Clubbed Thumb, Ars Nova, the Women’s Project and is a company member of the Guerrilla Shakespeare Project."
	},
	{
		"firstName"	: "Janice",
		"lastName" 	: "Orlandi",
		"bio"		: "Janice Orlandi is a Movement and Period Style Specialist and certified teacher of the Williamson Technique and Period Styles, including Edwardian, Elizabethan and Restoration style. She is an Assistant Professor at the University of the Arts; Brind School of Performing Arts. She is certified in Michael Chekhov Technique, and has extensive training with Anne Bogart, Tina Landau, and SITI Company members in Viewpoints, Suzuki and Composition. She is currently writing a book on physical techniques and methods for the actor and cross training,'The Art of Transformation Crossing Pedagogy'©. She is the Artistic Director of the Actors Movement Studio Conservatory. Her work as an educator, director, actress and movement coach has been seen at Williamstown Theater Festival; De Lindenberg Center, Netherlands; Odense State School, Denmark; Princeton Repertory Shakespeare Festival; Classic Stage Company; Circle Rep Lab, and other venues. She is certified to train teachers in the Williamson Technique, and was recently interviewed by American Theater Magazine (January 2011) on trends in Theater Education and Backstage on the physical approach to Shakespeare (March 2011)."
	}

]